; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link joint angle gripper)

(:predicates
	(connected ?j - joint ?l - link) ;; considero solo il fatto che un link sia connesso ad un joint, ignoro la direzione.
	(angle-before ?a - angle ?a1 - angle)
	(angle_joint ?a - angle ?j - joint)
	(link-before ?l - link ?l1 - link)
	(fixed ?j - joint)
	(grasp ?g - gripper ?l - link)
	(in-hand ?l - link)
	(in-centre ?j - joint)
	(free ?g - gripper)
	(affected ?j -joint ?l - link ?j1 - joint) ;; nel momento in cui uso un link come child, per ruotare il joint ?j1, tutti i joint successivi cambiano angolo.
)

;;;;;BASIC OPERATORS

;;move link in central position
(:action move-link-to-central
:parameters (?link1 - link ?joint1 ?joint2 - joint ?g2 - gripper)
:precondition (and (in-centre ?joint1) (connected ?joint2 ?link1) (free ?g2) (not (in-hand ?link1)))
:effect (and (not (in-centre ?joint1)) (in-centre ?joint2))
)

;;grasp 2 links to make movement
(:action take-links-to-move
:parameters (?link1 ?link2 - link ?joint - joint ?g2 ?g1 - gripper)
:precondition (and 
	(in-centre ?joint) 
	(free ?g2) 
	(free ?g1)
	(not (in-hand ?link1))
	(not (in-hand ?link2))
	(not (= ?g1 ?g2))
	(connected ?joint ?link1)
	(connected ?joint  ?link2)
	(not (= ?link1 ?link2))
)
:effect (and 
	(not (free ?g2)) 
	(not (free ?g1))
	(in-hand ?link1)
	(in-hand ?link2)
	(grasp ?g2 ?link2)
	(grasp ?g1 ?link1))
)


(:action increase_angle_first_child
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle ?g2 ?g1 - gripper)
:precondition (and
	(link-before ?link2 ?link1)
	(in-centre ?joint)
	(grasp ?g2 ?link2) 	
	(in-hand ?link1)
	(in-hand ?link2)
	(grasp ?g1 ?link1)
	(connected ?joint ?link1)
	(connected ?joint  ?link2)
	(not (= ?link1 ?link2))
	(angle_joint ?a1 ?joint)
	(angle-before ?a1 ?a2)
	)
:effect 
    (and 
	    (not (angle_joint ?a1 ?joint)) 
	    (angle_joint ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (affected ?js ?link1 ?joint) (not (= ?js ?joint)) (angle_joint ?a3 ?js) (angle-before ?a3 ?a4) )
		        (and
			        (not (angle_joint ?a3 ?js))
			        (angle_joint ?a4 ?js)
		        )
		    )
	    )
    )
)

(:action decrease_angle_first_child
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle ?g2 ?g1 - gripper)
:precondition (and
	(link-before ?link2 ?link1)
	(in-centre ?joint) 
	(grasp ?g2 ?link2) 	
	(in-hand ?link1)
	(in-hand ?link2)
	(grasp ?g1 ?link1)
	(connected ?joint ?link1)
	(connected ?joint  ?link2)
	(not (= ?link1 ?link2))
	(angle_joint ?a1 ?joint)
	(angle-before ?a2 ?a1)
	)
:effect 
    (and 
	    (not (angle_joint ?a1 ?joint)) 
	    (angle_joint ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (affected ?js ?link1 ?joint) (not (= ?js ?joint)) (angle_joint ?a3 ?js) (angle-before ?a4 ?a3) )
		        (and
			        (not (angle_joint ?a3 ?js))
			        (angle_joint ?a4 ?js)
		        )
		    )
	    )
    )
)

;;release 2 links to make movement
(:action release-links
:parameters (?link1 ?link2 - link ?joint - joint ?g2 ?g1 - gripper)
:precondition (and 
	(grasp ?g2 ?link2) 	
	(in-hand ?link1)
	(in-hand ?link2)
	(grasp ?g1 ?link1)
	(connected ?joint ?link1)
	(connected ?joint  ?link2)
	(not (= ?link1 ?link2))
)
:effect (and 
	(free ?g2)
	(free ?g1)
	(not (in-hand ?link1))
	(not (in-hand ?link2))
	(not (grasp ?g2 ?link2))
	(not (grasp ?g1 ?link1)))
)

)

; problem
(define (problem joint_bar)
(:domain joint_bar)
(:objects
    gleft gright - gripper
    link1 link2 link3 link4 - link
    joint1 joint2 joint3 - joint
    angle0 angle15 angle30 angle45 angle60 angle75 angle90 angle105 angle120 angle135 angle150 angle165 angle180 angle195 angle210 angle225 angle240 angle255 angle270 angle285 angle300 angle315 angle330 angle345 - angle)
(:init
    (link-before link1 link2)
    (link-before link2 link3)
    (link-before link3 link4)
    (affected joint1 link2 joint2)
    (affected joint2 link2 joint1)
    (affected joint3 link2 joint1)
    (affected joint2 link3 joint3)
    (affected joint1 link3 joint3)
    (affected joint3 link3 joint2)
    (angle-before angle0 angle15)
    (angle-before angle15 angle30)
    (angle-before angle30 angle45)
    (angle-before angle45 angle60)
    (angle-before angle60 angle75)
    (angle-before angle75 angle90)
    (angle-before angle90 angle105)
    (angle-before angle105 angle120)
    (angle-before angle120 angle135)
    (angle-before angle135 angle150)
    (angle-before angle150 angle165)
    (angle-before angle165 angle180)
    (angle-before angle180 angle195)
    (angle-before angle195 angle210)
    (angle-before angle210 angle225)
    (angle-before angle225 angle240)
    (angle-before angle240 angle255)
    (angle-before angle255 angle270)
    (angle-before angle270 angle285)
    (angle-before angle285 angle300)
    (angle-before angle300 angle315)
    (angle-before angle315 angle330)
    (angle-before angle330 angle345)
    (angle-before angle345 angle0)

    (connected joint1 link1)
    (connected joint1 link2)
    (connected joint2 link2)
    (connected joint2 link3)
    (connected joint3 link3)
    (connected joint3 link4)

    (angle_joint angle300 joint1)
    (angle_joint angle285 joint2)
    (angle_joint angle0 joint3)
    (in-centre joint2)
    (in-hand link3)
    (in-hand link4)
    (grasp gleft link3)
    (grasp gright link4))
(:goal
(and
    (angle_joint angle345 joint1)
    (angle_joint angle315 joint2)
    (angle_joint angle330 joint3)
    )
)
)

; plan
1. (release-links link4 link3 joint3 gleft gright)
   deleted: (in-hand link4) (in-hand link3) (grasp gleft link3) (grasp gright link4)
   added: (free gleft) (free gright)
   goals met: 0 of 3
2. (move-link-to-central link2 joint2 joint1 gright)
   deleted: (in-centre joint2)
   added: (in-centre joint1)
   goals met: 0 of 3
3. (take-links-to-move link2 link1 joint1 gleft gright)
   deleted: (free gleft) (free gright)
   added: (in-hand link2) (in-hand link1) (grasp gleft link1) (grasp gright link2)
   goals met: 0 of 3
4. (increase_angle_first_child link2 link1 joint1 angle300 angle315 gleft gright)
   deleted: (angle_joint angle300 joint1) (angle_joint angle285 joint2) (angle_joint angle0 joint3)
   added: (angle_joint angle315 joint1) (angle_joint angle300 joint2) (angle_joint angle15 joint3)
   goals met: 0 of 3
5. (release-links link2 link1 joint1 gleft gright)
   deleted: (in-hand link2) (in-hand link1) (grasp gleft link1) (grasp gright link2)
   added: (free gleft) (free gright)
   goals met: 0 of 3
6. (take-links-to-move link2 link1 joint1 gright gleft)
   deleted: (free gright) (free gleft)
   added: (in-hand link2) (in-hand link1) (grasp gright link1) (grasp gleft link2)
   goals met: 0 of 3
7. (increase_angle_first_child link2 link1 joint1 angle315 angle330 gright gleft)
   deleted: (angle_joint angle315 joint1) (angle_joint angle300 joint2) (angle_joint angle15 joint3)
   added: (angle_joint angle330 joint1) (angle_joint angle315 joint2) (angle_joint angle30 joint3)
   goals met: 1 of 3
8. (increase_angle_first_child link2 link1 joint1 angle330 angle345 gright gleft)
   deleted: (angle_joint angle330 joint1) (angle_joint angle315 joint2) (angle_joint angle30 joint3)
   added: (angle_joint angle345 joint1) (angle_joint angle330 joint2) (angle_joint angle45 joint3)
   goals met: 1 of 3
9. (release-links link2 link1 joint1 gright gleft)
   deleted: (in-hand link2) (in-hand link1) (grasp gright link1) (grasp gleft link2)
   added: (free gright) (free gleft)
   goals met: 1 of 3
10. (move-link-to-central link3 joint1 joint2 gright)
   deleted: (in-centre joint1)
   added: (in-centre joint2)
   goals met: 1 of 3
11. (take-links-to-move link3 link2 joint2 gleft gright)
   deleted: (free gleft) (free gright)
   added: (in-hand link3) (in-hand link2) (grasp gleft link2) (grasp gright link3)
   goals met: 1 of 3
12. (decrease_angle_first_child link3 link2 joint2 angle330 angle315 gleft gright)
   deleted: (angle_joint angle330 joint2) (angle_joint angle45 joint3)
   added: (angle_joint angle315 joint2) (angle_joint angle30 joint3)
   goals met: 2 of 3
13. (decrease_angle_first_child link3 link2 joint2 angle315 angle300 gleft gright)
   deleted: (angle_joint angle315 joint2) (angle_joint angle30 joint3)
   added: (angle_joint angle300 joint2) (angle_joint angle15 joint3)
   goals met: 1 of 3
14. (decrease_angle_first_child link3 link2 joint2 angle300 angle285 gleft gright)
   deleted: (angle_joint angle300 joint2) (angle_joint angle15 joint3)
   added: (angle_joint angle285 joint2) (angle_joint angle0 joint3)
   goals met: 1 of 3
15. (release-links link3 link2 joint2 gleft gright)
   deleted: (in-hand link3) (in-hand link2) (grasp gleft link2) (grasp gright link3)
   added: (free gleft) (free gright)
   goals met: 1 of 3
16. (take-links-to-move link3 link2 joint2 gright gleft)
   deleted: (free gright) (free gleft)
   added: (in-hand link3) (in-hand link2) (grasp gright link2) (grasp gleft link3)
   goals met: 1 of 3
17. (increase_angle_first_child link3 link2 joint2 angle285 angle300 gright gleft)
   deleted: (angle_joint angle285 joint2) (angle_joint angle0 joint3)
   added: (angle_joint angle300 joint2) (angle_joint angle15 joint3)
   goals met: 1 of 3
18. (increase_angle_first_child link3 link2 joint2 angle300 angle315 gright gleft)
   deleted: (angle_joint angle300 joint2) (angle_joint angle15 joint3)
   added: (angle_joint angle315 joint2) (angle_joint angle30 joint3)
   goals met: 2 of 3
19. (release-links link3 link2 joint2 gright gleft)
   deleted: (in-hand link3) (in-hand link2) (grasp gright link2) (grasp gleft link3)
   added: (free gright) (free gleft)
   goals met: 2 of 3
20. (move-link-to-central link3 joint2 joint3 gright)
   deleted: (in-centre joint2)
   added: (in-centre joint3)
   goals met: 2 of 3
21. (take-links-to-move link4 link3 joint3 gleft gright)
   deleted: (free gleft) (free gright)
   added: (in-hand link4) (in-hand link3) (grasp gleft link3) (grasp gright link4)
   goals met: 2 of 3
22. (decrease_angle_first_child link4 link3 joint3 angle30 angle15 gleft gright)
   deleted: (angle_joint angle30 joint3)
   added: (angle_joint angle15 joint3)
   goals met: 2 of 3
23. (decrease_angle_first_child link4 link3 joint3 angle15 angle0 gleft gright)
   deleted: (angle_joint angle15 joint3)
   added: (angle_joint angle0 joint3)
   goals met: 2 of 3
24. (decrease_angle_first_child link4 link3 joint3 angle0 angle345 gleft gright)
   deleted: (angle_joint angle0 joint3)
   added: (angle_joint angle345 joint3)
   goals met: 2 of 3
25. (decrease_angle_first_child link4 link3 joint3 angle345 angle330 gleft gright)
   deleted: (angle_joint angle345 joint3)
   added: (angle_joint angle330 joint3)
   goals met: 3 of 3
